package org.spider;

import org.python.antlr.PythonParser.test_return;

/**
 * 生出SQL语句
 * @author Mark
 *
 */
public class StringUtils {

	static String str= "龙源镇[101000]"+"城北镇[102000]"+"盐店镇[103000]"+"柳沟镇[104000]"+"武连镇[105000]"+
				"东宝镇[106000]"+"开封镇[107000]"+"元山镇[108000]"+"演圣镇[109000]"+"王河镇[110000]"+"公兴镇[111000]"+"金仙镇[112000]"+"香沉镇[113000]"+
				"白龙镇[114000]"+"鹤龄镇[115000]"+"杨村镇[116000]"+"羊岭镇[117000]"+"江口镇[118000]"+"木马镇[119000]"+"剑门关镇[120000]"+"汉阳镇[121000]"+"下寺镇[122000]";
	
	static String tt ="江石乡[200000]"+"田家乡[201000]"+"闻溪乡[202000]"+"姚家乡[203000]"+"北庙乡[204000]"+"西庙乡[205000]"+"义兴乡[206000]"+"毛坝乡[207000]"+
				"凉山乡[208000]"+"垂泉乡[209000]"+"秀钟乡[210000]"+"正兴乡[211000]"+"马灯乡[212000]"+"高池乡[213000]"+"碗泉乡[214000]"+"迎水乡[215000]"+
				"国光乡[216000]"+"柘坝乡[217000]"+"公店乡[218000]"+"吼狮乡[219000]"+"长岭乡[220000]"+"涂山乡[221000]"+"圈龙乡[222000]"+"碑垭乡[223000]"+"广坪乡[224000]"+"禾丰乡[225000]"+
				"店子乡[226000]"+"摇铃乡[227000]"+"樵店乡[228000]"+"锦屏乡[229000]"+"柏垭乡[230000]"+"高观乡[231000] "+"张王乡[232000]"+ "上寺乡[233000]";
	
	public static void test(){
		String[] arr =tt.split("]");
		int i=0;
		for(;i<arr.length;i++){
			String s =arr[i];
			String key =s.substring(0, 3);
			String value = s.substring(4);
			int j = i+28;
				String sql ="insert into AREA( ID,AREACODE, AREALEVEL, AREANAME, INUSE, PARENTCODE)"
						+ "VALUES ("+j+",'"+value+"', '5', '"+key+"', '1', '510823');";
				System.out.println(sql);
		}
	}
	
	public static void main(String[] args) {
		test();
	}
			
}
